Tekla Open API Reference for Tekla Structures 2025
ControlCircle.Point3 Property
 Gets or sets the third point. Point3 contains the calculated result from the orthogonal point and the center point after selecting the control circle.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point Point3 { get; set; }
Public Property Point3 As Point
	Get
	Set
Property Value
Type: Point
See Also
Reference
ControlCircle Class
Tekla.Structures.Model Namespace